 //問題と解答
 qa = new Array();
    qa[0] = ["「金銀版の初めに登場する博士」の名前は？","オーキド博士","ナナカマド博士","ウツギ博士","オダマキ博士",3];
    qa[1] = ["モンハンワールドで一番使用率が高い武器は？","双剣","太刀","大剣","操虫棍",2];
    qa[2] = ["次のうちゲームコーナがある街は？(ポケモン)","コガネシティ","ヒワダタウン","エンジュシティ","アサギシティ",1];
    qa[3] = ["マレーシアの首都は？","クアラルンプール","ビンタン","シンガポール","セントーサ",1];
    qa[4] = ["「青くて痛くて脆い」を書いた作者は？","今村夏子","吉野源三郎 ","暁なつめ","住野よる",4];
    qa[5] = ["麻痺状態にする効果がある技は次のうちどれ？","ピカピカサンダー","ざぶざぶサーフ","ふわふわフォール","ばちばちアクセル",2];
    qa[6] = ["鬼滅の刃の映画、「無限列車編」の公開日は？","2021年8月23日","2021年4月13日","2020年10月16日","2020年12月15日",3];
    qa[7] = ["この漢字の「篝火」読み方は？","かご","ひうち","とうか","かがりび",4];
    qa[8] = ["最新のゲームソフトで売り上げで一位の物は？","Ghost of Tsushima(ゴースト オブ ツシマ)","世界のアソビ大全５１(オンラインコード版)","あつまれ どうぶつの森(オンラインコード版)","ポケモンモンスター ソード・シールド エキスパンションパス(オンラインコード版)",3];
    qa[9] = ["この中の技で最強な物は？(ポケモンGO)","カウンター","でんきショック","ドラゴンテール","いわおとし",1];
    qa[10] = ["人気な海外旅行先ランキング","バンコク/タイ","グアム","セブ/フィリピン","ソウル/韓国",4];
    qa[11] = ["CODモバイルで一番人気な武器は？","BY15","MSMC","AK117","ICR-1",2];
    qa[12] = ["この中で一番人気なポケモンは？","レックウザ","ミミッキュ","ゲッコウガ","ルカリオ",3];
    qa[13] = ["この中で一番人気なプログラミング言語は？","JavaScript","C/C++","Python","Java",2];
    qa[14] = ["2024年の新紙幣の一万円札の人物は？","北里柴三郎","福沢諭吉","津田梅子","渋沢栄一",4];
    qa[15] = ["世界遺産の数は？(2020年 3月時点)","1121件","2145件","4638件","8902件",1];
    qa[16] = ["ポケモンマスターが初めて放送された日は？","1997年4月1日","1995年3月18日","1998年6月1日","2000年10月22日",1];
    qa[17] = ["日本で一番人気なソフトドリンクは？","オランジーナ","コカ・コーラ ","ファンタ グレープ","三ツ矢サイダー",2];
    qa[18] = ["日本で二番目に人気なスポーツは？","ゴルフ","サッカー","テニス","野球",4];
    qa[19] = ["この中で一番興行収入が高い映画は？","犬鳴村","カイジ ファイナルゲーム","スター・ウォーズ スカイウォーカーの夜明け" ,"パラサイト 半地下の家族",3];
    qa[20] = ["この中で一番人気な犬種は？","柴犬","ポメラニアン","チワワ","トイプードル",3];
    qa[21] = ["この中でスカイバトルに参加できないポケモンは次のうちどれ？","チリーン","ムウマ","ドーミラー","ヤジロン",2];
    qa[22] = ["二番目に威力が高い技は？","ハイドロカノン","だいばくはつ","ときのほうこう","じばく",2];
    qa[23] = ["ガンダムの機体で最強なのは？","ユニコーンガンダム","ストライクフリーダム","νガンダム","∀ガンダム",4];
    qa[24] = ["存在しない道具は次のうちどれ？","ちからのタスキ","きあいのタスキ","きあいのハチマキ","ちからのハチマキ",1];
    qa[25] = ["次のうち、俳句の季語として認定されていないものはどれ？","山下達郎","サザン","チューブ","ユーミン",3];
    qa[26] = ["ドラクエ１１最強呪文はどれ？","メラガイアー","ギガデイン","マヒャデドス","イオグランデ",1];
    qa[27] = ["FFシリーズで一番売れたソフトはどれ？","ファイナルファンタジーIV","ファイナルファンタジーV","ファイナルファンタジーIII","ファイナルファンタジーVII",4];
    qa[28] = ["ドラクエタクトで一番強いキャラはどれ？","キラーマシン","ワイドキング","にじくじゃく","スライムエンペラー",2];
    qa[29] = ["世界で一番大きくには？","カナダ","アメリカ合衆国","中国","ロシア",4];
   
   

  

//ランダムの生成
 function run(){ 
 for (let i = qa.length-1; i>=0; i--){
  let rand = Math.floor(Math.random() * (i+1));
  let temp = qa[i];
  qa[i] = qa[rand]
  qa[rand] = temp;
  document.getElementById("text_q").innerHTML = i + "回目= " + qa;
  quiz(qa);
 }
  }


 //初期設定
 q_sel = 4; //選択肢の数
 q_max = 10;
 setReady(qa);

function setReady() {
 count = 0; //問題番号
 ansers = new Array(); //解答記録
 run(""); //再テストの場合のランダムの生成
 quiz(""); //最初の問題
 }
 
 //問題表示
function quiz() { 
  let s, n;

  //問題
 document.getElementById("text_q").innerHTML = (count + 1) + "問目：" + qa[count][0];

  //選択肢
 s = "";
   for (n=1;n<=q_sel;n++) {
    s += "<a href='javascript:anser(" + n + ")'>" + n + "：" + qa[count][n] + "</a>";
   }
 document.getElementById("text_s").innerHTML = s;
 
 }

 //解答表示
function anser(num) { 
  let s;
  s = (count + 1) + "問目：";

  //答え合わせ
 if (num == qa[count][q_sel + 1]) {
   //正解
  ansers[count] = "○";
  } else {
   ansers[count] = "×";
  }
  s += ansers[count] + qa[count][num];
  document.getElementById("text_a").innerHTML = s;
  

  //次の問題を表示
 count++;
  if (count < q_max) {
   quiz();
  } else {
   //終了
  s = "<table border='2'><caption>成績発表</caption>";
   //1行目
  s += "<tr><th>問題</th>";
   for (n=0;n<q_max;n++) {
    s += "<th>" + (n+1) + "</th>";
   }
   s += "</tr>";
   //2行目
  s += "<tr><th>成績</th>";
   for (n=0;n<q_max;n++) {
    s += "<td>" + ansers[n] + "</td>";
   }
   s += "</tr>";
   s += "</table>";
   document.getElementById("text_q").innerHTML = s;
   document.getElementById("text_s").innerHTML = "<a href='javascript:setReady()'>問題を最初からする</a>";
   document.getElementById("text_a").innerHTML = "";
  }
 }

// //紙吹雪
//  let canvas = document.getElementById('canvas');//canvasを取得
//  let ctx = canvas.getContext('2d')//canvasのコンテキストを取得

// COLORS = [
//       [238, 96, 169],
//       [68, 213, 217],
//       [245, 187, 152],
//       [144, 148, 188],
//       [235, 234, 77]
// ];

// //canvasのサイズ
// let wd_width = window.innerWidth;
// let wd_height = window.innerHeight;
// ctx.canvas.width = w;
// ctx.canvas.height = h;






//